import type { Metadata } from 'next'

export const metadata: Metadata = {
  title: 'Пользовательское соглашение',
  description: 'Компания Озон Градус - Пользовательское соглашение',
  generator: 'Ozon Gradus',
  referrer: 'origin-when-cross-origin',
  keywords: ['Работа город казань', 'Работа г. Казань', 'Работа г казань склад', 'Работа г. Казань склад', 'Работа Казань склад озон', 'Озон склад', 'Работа озон склад', 'Вакансия озон склад', 'Вакансия озон Казань', 'Работа г Москва склад озон', 'Работа Москва склад', 'Вакансия озон г Москва склад', 'Вакансия вахта Казань', 'Вахта от 15 смен Казань', 'Вахта г Казань', 'Вахта склад Г. Казань'],
  creator: 'Плотников Ренат Рустамович',
  openGraph: {
    title: 'Пользовательское соглашение',
    description: 'Компания Озон Градус - Пользовательское соглашение',
    url: 'https://ozon-gradus.ru/agreements',
    siteName: 'ozon-gradus.ru',
    images: [
      {
        url: 'https://sun9-78.userapi.com/impg/RvKUInLLcG62G_Ew7f6OYKDRltie6qIDkqdfAw/_SuL6b9ukKM.jpg?size=1280x960&quality=95&sign=80eaa3d3857a35ed6e4c7ccae934828e&c_uniq_tag=w5FL5nveHZauC2ijOWDs37GHiVw2or8vqEdB9x5IS-g&type=album', // Must be an absolute URL
        width: 800,
        height: 600,
      },
      {
        url: 'https://sun9-78.userapi.com/impg/RvKUInLLcG62G_Ew7f6OYKDRltie6qIDkqdfAw/_SuL6b9ukKM.jpg?size=1280x960&quality=95&sign=80eaa3d3857a35ed6e4c7ccae934828e&c_uniq_tag=w5FL5nveHZauC2ijOWDs37GHiVw2or8vqEdB9x5IS-g&type=album', // Must be an absolute URL
        width: 1800,
        height: 1600,
        alt: 'Вакансия оператор склада, складная логистика г.Казань озон',
      },
    ],
    locale: 'ru_RU',
    type: 'website',
  },
  robots: {
    index: true,
    follow: true,
    googleBot: {
      index: true,
      follow: true,
      'max-image-preview': 'large',
      'max-snippet': -1,
    },
  },
}

export default function Agreement() {
    return (
            <div className='block'>
              <h1>Пользовательское соглашение</h1>

Сайт ozon-gradus не является средством массовой информации. <br /><br />

Используя сайт, Вы соглашаетесь с условиями данного соглашения.<br />
Если Вы не согласны с условиями данного соглашения, не используйте сайт ozon-gradus!<br /><br />

<h3>Права и обязанности сторон</h3>
Пользователь имеет право:<br />
- осуществлять поиск информации на сайте<br />
- получать информацию на сайте<br />
- создавать информацию для сайта<br />
- распространять информацию на сайте<br />
- комментировать контент, выложенный на сайте<br />
- изменять рейтинг пользователей<br />
- копировать информацию на другие сайты с указанием источника<br />
- использовать информацию сайта в личных некоммерческих целях<br />
- использовать информацию сайта в коммерческих целях с разрешения Администрации<br />

<h3>Администрация имеет право:</h3>
- по своему усмотрению и необходимости создавать, изменять, отменять правила<br />
- ограничивать доступ к любой информации на сайте<br />
- создавать, изменять, удалять информацию<br />
- удалять учетные записи<br />
- отказывать в регистрации без объяснения причин<br />

<h3>Пользователь обязуется:</h3>
- обеспечивать сохранность личных данных от доступа третьих лиц<br />
- не нарушать работоспособность сайта<br />
- не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу<br />
- не совершать действия, направленные на введение других Пользователей в заблуждение<br />
- не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам<br />
- не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами<br />

<h3>Администрация обязуется:</h3>
- поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.<br />
- осуществлять разностороннюю защиту учетной записи Пользователя<br />
- защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила<br />
- предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом<br />

<h3>Ответственность сторон</h3>
- администрация не несет никакой ответственности за достоверность информации, скопированной из других источников<br />
- администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг<br />
- администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br />
- в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса

<h3>Условия действия Соглашения</h3>
Данное Соглашение вступает в силу при любом использовании данного сайта.<br />
Соглашение перестает действовать при появлении его новой версии.<br />
Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.<br />
Администрация не оповещает пользователей об изменении в Соглашении.<br />
            </div>
    )
  }
  